---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.WallOffset
source: html/acec047b-2881-8bd2-c741-dfd7be0059a4.htm
---
# Autodesk.Revit.DB.WallSweepInfo.WallOffset Property

The offset from the sweep or reveal to the wall.

## Syntax (C#)
```csharp
public double WallOffset { get; set; }
```